ストライピング　１つのデータを複数のハードディスクに書き込む

ミラーリング　複数のディスクに同じデータを書き込む

プロジェクトマッピング　ＰＣ上の凹凸のある立体物を投影する

３Ｄプリンター３ｄＣＧデータ用いて実物作る

３Ｄスキャナー立体物から３ｄＣＧデータに変換する

仮想化　１つのサーバに複数のＯＳ起動させ、複数のサーバあるように見せる

シンプロビジョニング　複数の利用者が仮想サーバを利用しているとき、仮想サーバの利用しているとき仮想ディスクを共有している物理ディスクから割り当てる

ライブマイグレーション　仮想サーバで運用しているＯＳを停止せず、物理サーバから他のサーバへ移動し、元のサーバを修理する

レプリケーション　データを複製(レプリカ）ＤＢに複製、災害発生時にＤＢを復旧

バッチ処理　まとまったデータを一括して処理する

クライアントサーバ　サービスを提供する「サーバ」、提供される「クライアント」

ピアツーピア　サーバとクライアントを１つずつのＰＣにやらせる

クラスタシステム　複数のＰＣを連携させ、１つの高性能ＰＣを実現

グリッドコンピューティング　クラスタシステムの大規模バージョン(１００ＰＣ連携

３層クライアントサーバ　プレゼンテーション層（ブラウザ、アプリで画面表示）

ファンクション層（ＡＰによるシステムを提供する）

データ層　データへのアクセス機能提供）に分ける

ＷＥＢ３層構成　ＷＥＢサーバ（ユーザからリクエスト受け取り、ＡＰに処理を送る

アプリケーションサーバ　リクエストをＡＰで処理。必要に応じてＤＢサーバに送る

データベースサーバ　ＤＢに問い合わせ、ユーザの情報を問い合わせる